In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [3]:
df = pd.read_csv('carprices.csv')
df.head()

   Mileage  Age(yrs)  Sell Price($)
0    69000         6          18000
1    35000         3          34000
2    57000         5          26100
3    22500         2          40000
4    46000         4          31500

X -> Feature  
y -> Target

In [4]:
X = df[['Mileage', 'Age(yrs)']]
X.head()

   Mileage  Age(yrs)
0    69000         6
1    35000         3
2    57000         5
3    22500         2
4    46000         4

In [5]:
y = df[['Sell Price($)']]
y.head()

   Sell Price($)
0          18000
1          34000
2          26100
3          40000
4          31500

In [6]:
from sklearn.model_selection import train_test_split

# train_test_split(features, target, test_size) constructor
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=3)

In [7]:
X_train.head()

    Mileage  Age(yrs)
6     52000         5
7     72000         6
15    25400         3
12    59000         5
9     67000         6

In [8]:
X_test.head()

    Mileage  Age(yrs)
14    82450         7
2     57000         5
1     35000         3
17    69000         5
4     46000         4

In [9]:
y_train.head()

    Sell Price($)
6           32000
7           19300
15          35000
12          26000
9           22000

In [10]:
y_test.head()

    Sell Price($)
14          19400
2           26100
1           34000
17          19700
4           31500